app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins" ORDER BY created_at desc LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "pins"
---
  def index
    @pins = Pin.order("created_at desc").page(params[:page]).per_page(20)

SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = 1
---
  def index_user

    @pins = current_user.pins.all

INSERT INTO "pins" ("approved", "created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_remote_url", "image_updated_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    # @pin = Pin.new(params[:pin])

    @pin = current_user.pins.new(params[:pin])

    respond_to do |format|
      if @pin.save